jfazekas21/blackBird-ESP32-S3/source/components/JFS/Sample/Driver/NOR/ST_STM32U585/FS_NOR_HW_SPIFI_STM32U585_ST_B_U585I_IOT02A_Discovery.c
/*********************************************************************
*                     SEGGER Microcontroller GmbH                    *
*                        The Embedded Experts                        *
**********************************************************************
*                                                                    *
*       (c) 2003 - 2022  SEGGER Microcontroller GmbH                 *
*                                                                    *
*       www.segger.com     Support: support_emfile@segger.com        *
*                                                                    *
**********************************************************************
*                                                                    *
*       emFile * File system for embedded applications               *
*                                                                    *
*                                                                    *
*       Please note:                                                 *
*                                                                    *
*       Knowledge of this file may under no circumstances            *
*       be used to write a similar product for in-house use.         *
*                                                                    *
*       Thank you for your fairness !                                *
*                                                                    *
**********************************************************************
*                                                                    *
*       emFile version: V5.18.1                                      *
*                                                                    *
**********************************************************************
----------------------------------------------------------------------
Licensing information
Licensor:                 SEGGER Microcontroller Systems LLC
Licensed to:              Cardinal Detecto, 102 East Daugherty St, Webb City, MO 64870
Licensed SEGGER software: emFile
License number:           FS-00842
License model:            SSL [Single Developer Single Platform Source Code License]
Licensed product:         -
Licensed platform:        Xtensa LX6 (ESP32), Eclipse
Licensed number of seats: 1
----------------------------------------------------------------------
Support and Update Agreement (SUA)
SUA period:               2022-03-24 - 2022-09-24
Contact to extend SUA:    sales@segger.com
-------------------------- END-OF-HEADER -----------------------------

File    : FS_NOR_HW_SPIFI_STM32U585_ST_B_U585I_IOT02A_Discovery.c
Purpose : Low-level flash driver for STM32U5 OCTO SPI interface.
Literature:
  [1] RM0456 Reference manual STM32U575/585 Arm-based 32-bit MCUs
    (\\fileserver\Techinfo\Company\ST\MCU\STM32\STM32U5\RM0456-STM32U575585.pdf)
  [2] Datasheet STM32U585xx
    (\\fileserver\Techinfo\Company\ST\MCU\STM32\STM32U5\DS13086_STM32U585AI_Rev4.pdf)
  [3] Errata sheet STM32U575xx STM32U585xx
    (\\fileserver\Techinfo_rw\Company\ST\MCU\STM32\STM32U5\ES0499_Rev_0.3_Pub.pdf)
  [4] UM2839 User manual Discovery kit for IoT node with STM32U5 Series
    (\\fileserver\Techinfo\Company\ST\MCU\STM32\STM32U5\EvalBoard\B-U585I-IOT02A Discovery kit\UM2839_B-U585i-iot02a_discovery-kit-(stm32u5-series)_rev3.pdf)
  [5] Datasheet MX25LM51245G
    ("\\FILESERVER\Techinfo\Company\Macronix\SPI_NOR_Flash\MX25LM51245G, 3V, 512Mb, v1.1.pdf")
*/

/*********************************************************************
*
*       #include section
*
**********************************************************************
*/
#include "FS.h"

/*********************************************************************
*
*      Defines, configurable
*
**********************************************************************
*/
#ifndef   FS_NOR_HW_OCTOSPI_CLK_HZ
  #define FS_NOR_HW_OCTOSPI_CLK_HZ      160000000uL     // Frequency of the clock supplied to OCTOSPI peripheral
#endif

#ifndef   FS_NOR_HW_NOR_CLK_HZ
  #define FS_NOR_HW_NOR_CLK_HZ          40000000uL      // Frequency of the clock supplied to NOR flash device
#endif

#ifndef   FS_NOR_HW_USE_OS
  #define FS_NOR_HW_USE_OS              0               // Enables/disables the interrupt-driven operation.
#endif

#ifndef   FS_NOR_HW_USE_MEM_MODE
  #define FS_NOR_HW_USE_MEM_MODE        1               // Enables or disables the reading of NOR flash data via system memory.
                                                        // Has to be set to 0 if the file system is configured with FS_NOR_LINE_SIZE
                                                        // smaller than or equal to 2 because of the errata 2.6.7 in ES0499 Rev. 3.
#endif

/*********************************************************************
*
*       #include section, conditional
*
**********************************************************************
*/
#if FS_NOR_HW_USE_OS
  #include "RTOS.h"
  #include "stm32u5xx.h"
  #include "FS_OS.h"
#endif

/*********************************************************************
*
*       Defines, non-configurable
*
**********************************************************************
*/

/*********************************************************************
*
*       Octo-SPI registers
*/
#define OCTOSPI_BASE_ADDR       0x420D2400uL
#define OCTOSPI_CR              (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x000))
#define OCTOSPI_DCR1            (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x008))
#define OCTOSPI_DCR2            (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x00C))
#define OCTOSPI_DCR3            (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x010))
#define OCTOSPI_SR              (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x020))
#define OCTOSPI_FCR             (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x024))
#define OCTOSPI_DLR             (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x040))
#define OCTOSPI_AR              (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x048))
#define OCTOSPI_DR              (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x050))
#define OCTOSPI_DR_BYTE         (*(volatile U8* )(OCTOSPI_BASE_ADDR + 0x050))
#define OCTOSPI_DR_HWORD        (*(volatile U16*)(OCTOSPI_BASE_ADDR + 0x050))
#define OCTOSPI_PSMKR           (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x080))
#define OCTOSPI_PSMAR           (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x088))
#define OCTOSPI_PIR             (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x090))
#define OCTOSPI_CCR             (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x100))
#define OCTOSPI_TCR             (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x108))
#define OCTOSPI_IR              (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x110))
#define OCTOSPI_ABR             (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x120))
#define OCTOSPI_LPTR            (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x130))
#define OCTOSPI_WCCR            (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x180))
#define OCTOSPI_WTCR            (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x188))
#define OCTOSPI_WIR             (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x190))
#define OCTOSPI_WABR            (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x1A0))
#define OCTOSPI_HLCR            (*(volatile U32*)(OCTOSPI_BASE_ADDR + 0x200))

/*********************************************************************
*
*       Port F registers
*/
#define GPIOF_BASE_ADDR         0x42021400uL
#define GPIOF_MODER             (*(volatile U32*)(GPIOF_BASE_ADDR + 0x00))
#define GPIOF_OSPEEDR           (*(volatile U32*)(GPIOF_BASE_ADDR + 0x08))
#define GPIOF_PUPDR             (*(volatile U32*)(GPIOF_BASE_ADDR + 0x0C))
#define GPIOF_ODR               (*(volatile U32*)(GPIOF_BASE_ADDR + 0x14))
#define GPIOF_AFRH              (*(volatile U32*)(GPIOF_BASE_ADDR + 0x24))
#define GPIOF_AFRL              (*(volatile U32*)(GPIOF_BASE_ADDR + 0x20))

/*********************************************************************
*
*       Port H registers
*/
#define GPIOH_BASE_ADDR         0x42021C00uL
#define GPIOH_MODER             (*(volatile U32*)(GPIOH_BASE_ADDR + 0x00))
#define GPIOH_OSPEEDR           (*(volatile U32*)(GPIOH_BASE_ADDR + 0x08))
#define GPIOH_PUPDR             (*(volatile U32*)(GPIOH_BASE_ADDR + 0x0C))
#define GPIOH_ODR               (*(volatile U32*)(GPIOH_BASE_ADDR + 0x14))
#define GPIOH_AFRL              (*(volatile U32*)(GPIOH_BASE_ADDR + 0x20))
#define GPIOH_AFRH              (*(volatile U32*)(GPIOH_BASE_ADDR + 0x24))

/*********************************************************************
*
*       Port I registers
*/
#define GPIOI_BASE_ADDR         0x42022000uL
#define GPIOI_MODER             (*(volatile U32*)(GPIOI_BASE_ADDR + 0x00))
#define GPIOI_OSPEEDR           (*(volatile U32*)(GPIOI_BASE_ADDR + 0x08))
#define GPIOI_PUPDR             (*(volatile U32*)(GPIOI_BASE_ADDR + 0x0C))
#define GPIOI_ODR               (*(volatile U32*)(GPIOI_BASE_ADDR + 0x14))
#define GPIOI_AFRL              (*(volatile U32*)(GPIOI_BASE_ADDR + 0x20))
#define GPIOI_AFRH              (*(volatile U32*)(GPIOI_BASE_ADDR + 0x24))

/*********************************************************************
*
*       Reset and clock control
*/
#define RCC_BASE_ADDR           0x46020C00uL
#define RCC_AHB2RSTR2           (*(volatile U32*)(RCC_BASE_ADDR + 0x68))
#define RCC_AHB1ENR             (*(volatile U32*)(RCC_BASE_ADDR + 0x88))
#define RCC_AHB2ENR1            (*(volatile U32*)(RCC_BASE_ADDR + 0x8C))
#define RCC_AHB2ENR2            (*(volatile U32*)(RCC_BASE_ADDR + 0x90))
#define RCC_CCIPR2              (*(volatile U32*)(RCC_BASE_ADDR + 0xE4))

/*********************************************************************
*
*       Masks for the peripheral enable bits
*/
#define AHB1ENR_DCACHE1EN       30
#define AHB2ENR1_GPIOFEN        5
#define AHB2ENR1_GPIOHEN        7
#define AHB2ENR1_GPIOIEN        8
#define AHB2ENR1_OCTOSPIMEN     21
#define AHB2ENR2_OCTOSPI2EN     8
#define CCIPR2_OCTOSPISEL_BIT   20
#define CCIPR2_OCTOSPISEL_MASK  0x3uL

/*********************************************************************
*
*       GPIO bit positions of SPI signals
*/
#define NOR_CS_BIT              5     // Port I
#define NOR_DQS_BIT             12    // Port F
#define NOR_CLK_BIT             4     // Port F
#define NOR_D0_BIT              0     // Port F
#define NOR_D1_BIT              1     // Port F
#define NOR_D2_BIT              2     // Port F
#define NOR_D3_BIT              3     // Port F
#define NOR_D4_BIT              9     // Port H
#define NOR_D5_BIT              10    // Port H
#define NOR_D6_BIT              11    // Port H
#define NOR_D7_BIT              12    // Port H

/*********************************************************************
*
*       GPIO bits and masks
*/
#define OSPEEDR_HIGH            0x2uL
#define OSPEEDR_MASK            0x3uL
#define MODER_ALT               0x2uL
#define MODER_MASK              0x3uL
#define AFR_MASK                0xFuL

/*********************************************************************
*
*       Octo-SPI control register
*/
#define CR_EN_BIT               0
#define CR_ABORT_BIT            1
#define CR_DMAEN_BIT            2
#define CR_TCEN_BIT             3
#define CR_FTHRES_BIT           8
#define CR_FTHRES_MASK          0x2Fu
#define CR_TRIE_BIT             16
#define CR_TCIE_BIT             17
#define CR_FTIE_BIT             18
#define CR_SMIE_BIT             19
#define CR_TOIE_BIT             20
#define CR_APMS_BIT             22
#define CR_FMODE_BIT            28
#define CR_FMODE_WRITE          0x00uL
#define CR_FMODE_READ           0x01uL
#define CR_FMODE_POLL           0x02uL
#define CR_FMODE_MMAP           0x03uL
#define CR_FMODE_MASK           0x03uL

/*********************************************************************
*
*       Octo-SPI device configuration register 1
*/
#define DCR1_CKMODE_BIT         0
#define DCR1_CSHT_BIT           8
#define DCR1_DEVSIZE_BIT        16
#define DCR1_DEVSIZE_MAX        0x1Fu
#define DCR1_MTYP_BIT           24
#define DCR1_MTYP_MICRON        0uL
#define DCR1_MTYP_MACRONIX      1uL
#define DCR1_MTYP_STANDARD      2uL
#define DCR1_MTYP_MASK          0x7uL

/*********************************************************************
*
*       Octo-SPI device configuration register 2
*/
#define DCR2_PRESCALER_BIT      0
#define DCR2_PRESCALER_MAX      0xFFu

/*********************************************************************
*
*       Octo-SPI status register
*/
#define SR_TEF_BIT              0
#define SR_TCF_BIT              1
#define SR_FTF_BIT              2
#define SR_SMF_BIT              3
#define SR_TOF_BIT              4
#define SR_BUSY_BIT             5
#define SR_FLEVEL_BIT           8
#define SR_FLEVEL_MASK          0x3Fu

/*********************************************************************
*
*       Octo-SPI communication configuration register
*/
#define CCR_IMODE_BIT           0
#define CCR_IDTR_BIT            3
#define CCR_ISIZE_BIT           4
#define CCR_ISIZE_MASK          0x03uL
#define CCR_ADMODE_BIT          8
#define CCR_ADDTR_BIT           11
#define CCR_ADSIZE_BIT          12
#define CCR_ADSIZE_MASK         0x03uL
#define CCR_ABMODE_BIT          16
#define CCR_ABDTR_BIT           19
#define CCR_ABSIZE_BIT          20
#define CCR_ABSIZE_MASK         0x03uL
#define CCR_DMODE_BIT           24
#define CCR_DMODE_NONE          0x00uL
#define CCR_DMODE_SINGLE        0x01uL
#define CCR_DMODE_DUAL          0x02uL
#define CCR_DMODE_QUAD          0x03uL
#define CCR_DMODE_OCTO          0x04uL
#define CCR_DDTR_BIT            27
#define CCR_DQSE_BIT            29

/*********************************************************************
*
*       Octo-SPI timing configuration register
*/
#define TCR_DCYC_BIT            0
#define TCR_DCYC_MASK           0x1FuL
#define TCR_DHQC_BIT            28

/*********************************************************************
*
*       Misc. defines
*/
#define NUM_BYTES_FIFO          16
#define OCTOSPI_PRIO            15
#define WAIT_TIMEOUT_MS         1000
#define CYCLES_PER_MS           150           // Blocks the execution for about 1ms on a CPU running at 78 Mhz.
#define WAIT_TIMEOUT_CYCLES     (WAIT_TIMEOUT_MS * CYCLES_PER_MS)
#define CR2_IOSV_BIT            9
#define LOW_POWER_TIMEOUT       32

/*********************************************************************
*
*      Static data
*
**********************************************************************
*/
static            U32 _ClkDiv;
#if FS_NOR_HW_USE_OS
  static volatile U32 _StatusOSPI;
#endif

/*********************************************************************
*
*      Static code
*
**********************************************************************
*/

/*********************************************************************
*
*       _CalcClockDivider
*
*  Function description
*    Calculates the clock divider of Octio-SPI controller.
*
*  Parameters
*    pFreq_Hz     [OUT] Clock frequency.
*
*  Return value
*    Value of clock divisor.
*/
static U32 _CalcClockDivider(U32 * pFreq_Hz) {
  U32 Div;
  U32 Freq_Hz;
  U32 MaxFreq_Hz;

  //
  // Calculate the divider for the specified QSPI frequency.
  //
  Div        = 0;
  MaxFreq_Hz = *pFreq_Hz;
  for (;;) {
    Freq_Hz = FS_NOR_HW_OCTOSPI_CLK_HZ / (Div + 1u);
    if (Freq_Hz <= MaxFreq_Hz) {
      break;
    }
    ++Div;
    if (Div == DCR2_PRESCALER_MAX) {
      break;
    }
  }
  *pFreq_Hz = Freq_Hz;
  return Div;
}

/*********************************************************************
*
*       _CalcTransferMode
*
*  Function description
*    Calculates the transfer mode of Octo-SPI controller.
*
*  Parameters
*    BusWidth       Number of data lines to be used for the data transfer.
*    NumBytes       Number of bytes to be transferred. Can be 0.
*
*  Return value
*    Value of transfer mode.
*/
static U32 _CalcTransferMode(unsigned BusWidth, U32 NumBytes) {
  U32 Mode;

  Mode = CCR_DMODE_NONE;
  if (NumBytes != 0) {
    switch (BusWidth) {
    case 1:
      Mode = CCR_DMODE_SINGLE;
      break;
    case 2:
      Mode = CCR_DMODE_DUAL;
      break;
    case 4:
      Mode = CCR_DMODE_QUAD;
      break;
    case 8:
      Mode = CCR_DMODE_OCTO;
      break;
    default:
      break;
    }
  }
  return Mode;
}

/*********************************************************************
*
*       _CalcNumCycles
*
*  Function description
*    Calculates the number of clock cycles required
*    to transfer a specified number of bytes.
*
*  Parameters
*    BusWidth       Number of data lines to be used for the data transfer.
*    NumBytes       Number of bytes to be transferred. Can be 0.
*    IsDTRMode      Indicates if the data is transferred on both clock cycles.
*
*  Return value
*    Number of clock cycles.
*/
static U32 _CalcNumCycles(unsigned BusWidth, U32 NumBytes, int IsDTRMode) {
  U32 NumCycles;

