jfazekas21/blackBird-ESP32-S3/source/components/JFS/Sample/Driver/NOR/ST_STM32U585/FS_NOR_HW_SPIFI_STM32U585_ST_B_U585I_IOT02A_Discovery.c
  NumCycles = 0;
  if (NumBytes != 0) {
    NumCycles = NumBytes << 3;        // Assume 8-bits per byte.
    switch (BusWidth) {
    case 2:
      NumCycles >>= 1;
      break;
    case 4:
      NumCycles >>= 2;
      break;
    case 8:
      NumCycles >>= 3;
      break;
    default:
      break;
    }
    if (IsDTRMode != 0) {
      NumCycles >>= 1;                // The data is sent on both clock edges.
    }
  }
  return NumCycles;
}

/*********************************************************************
*
*       _CalcMemType
*
*  Function description
*    Calculates the memory type of the NOR flash device.
*
*  Parameters
*    Flags      Operation flags.
*
*  Return value
*    Memory type.
*
*  Additional information
*    MTYPE = 0 (Micron)    FS_NOR_HW_FLAG_DQS_INVERTED = 1, FS_NOR_SPIFI_FLAG_DTR_D1_D0 = 0
*    MTYPE = 1 (Macronix)  FS_NOR_HW_FLAG_DQS_INVERTED = 0, FS_NOR_SPIFI_FLAG_DTR_D1_D0 = 1
*    MTYPE = 2 (standard)  FS_NOR_HW_FLAG_DQS_INVERTED = 0, FS_NOR_SPIFI_FLAG_DTR_D1_D0 = 0
*/
static U32 _CalcMemType(unsigned Flags) {
  U32 MemType;

  MemType = DCR1_MTYP_STANDARD;
  if ((Flags & FS_NOR_HW_FLAG_DQS_INVERTED) != 0) {
    if ((Flags & FS_NOR_HW_FLAG_DTR_D1_D0) == 0) {
      MemType = DCR1_MTYP_MICRON;
    }
  } else {
    if ((Flags & FS_NOR_HW_FLAG_DTR_D1_D0) != 0) {
      MemType = DCR1_MTYP_MACRONIX;
    }
  }
  return MemType;
}

/*********************************************************************
*
*       _WaitForTransferComplete
*
*  Function description
*    Waits for a data transfer to complete.
*
*  Return value
*    ==0      OK, transfer completed successfully.
*    !=0      An error occurred.
*/
static int _WaitForTransferComplete(void) {
  int r;
  U32 Status;

  r = 0;              // Set to indicate success.
#if FS_NOR_HW_USE_OS
  for (;;) {
    Status = _StatusOSPI;
    if (Status & (1uL << SR_TCF_BIT)) {
      break;
    }
    r = FS_X_OS_Wait(WAIT_TIMEOUT_MS);
    if (r != 0) {
      break;
    }
  }
#else
  U32 TimeOut;

  TimeOut = WAIT_TIMEOUT_CYCLES;
  for (;;) {
    Status = OCTOSPI_SR;
    if (Status & (1uL << SR_TCF_BIT)) {
      break;
    }
    if (--TimeOut == 0) {
      r = 1;
      break;
    }
  }
#endif
  return r;
}

/*********************************************************************
*
*       _WaitForData
*
*  Function description
*    Waits for data to be received from NOR flash device.
*
*  Parameters
*    NumBytesExpected   Number of bytes expected to be received.
*
*  Return value
*    ==0      OK, specified number of bytes received.
*    !=0      An error occurred.
*/
static int _WaitForData(U32 NumBytesExpected) {
  int r;
  U32 Status;
  U32 NumBytesAvail;

  r = 0;              // Set to indicate success.
#if FS_NOR_HW_USE_OS
  for (;;) {
    Status = _StatusOSPI;
    NumBytesAvail = (Status >> SR_FLEVEL_BIT) & SR_FLEVEL_MASK;
    if ((NumBytesAvail >= 4) || (NumBytesAvail >= NumBytesExpected)) {
      break;
    }
    r = FS_X_OS_Wait(WAIT_TIMEOUT_MS);
    if (r != 0) {
      break;
    }
  }
#else
  U32 TimeOut;

  TimeOut = WAIT_TIMEOUT_CYCLES;
  for (;;) {
    Status = OCTOSPI_SR;
    NumBytesAvail = (Status >> SR_FLEVEL_BIT) & SR_FLEVEL_MASK;
    if ((NumBytesAvail >= 4) || (NumBytesAvail >= NumBytesExpected)) {
      break;
    }
    if (--TimeOut == 0) {
      r = 1;
      break;
    }
  }
#endif // FS_NOR_HW_USE_OS
  return r;
}

/*********************************************************************
*
*       _WaitForFreeSpace
*
*  Function description
*    Waits for data to be sent to NOR flash device.
*
*  Parameters
*    NumBytesExpected   Number of bytes expected to be sent.
*
*  Return value
*    ==0      OK, specified number of bytes sent.
*    !=0      An error occurred.
*/
static int _WaitForFreeSpace(U32 NumBytesExpected) {
  int r;
  U32 Status;
  U32 NumBytesFree;

  r = 0;              // Set to indicate success.
#if FS_NOR_HW_USE_OS
  for (;;) {
    Status = _StatusOSPI;
    NumBytesFree = (Status >> SR_FLEVEL_BIT) & SR_FLEVEL_MASK;
    NumBytesFree = NUM_BYTES_FIFO - NumBytesFree;
    if ((NumBytesFree >= 4) || (NumBytesFree >= NumBytesExpected)) {
      break;
    }
    r = FS_X_OS_Wait(WAIT_TIMEOUT_MS);
    if (r != 0) {
      break;
    }
  }
#else
  U32 TimeOut;

  TimeOut = WAIT_TIMEOUT_CYCLES;
  for (;;) {
    Status = OCTOSPI_SR;
    NumBytesFree = (Status >> SR_FLEVEL_BIT) & SR_FLEVEL_MASK;
    NumBytesFree = NUM_BYTES_FIFO - NumBytesFree;
    if ((NumBytesFree >= 4) || (NumBytesFree >= NumBytesExpected)) {
      break;
    }
    if (--TimeOut == 0) {
      r = 1;
      break;
    }
  }
#endif // FS_NOR_HW_USE_OS
  return r;
}

/*********************************************************************
*
*       _ClearFlags
*
*  Function description
*    Sets all the status flags to 0.
*/
static int _ClearFlags(void) {
  U32 TimeOut;
  int r;

  OCTOSPI_FCR = 0
              | (1uL << SR_TEF_BIT)
              | (1uL << SR_TCF_BIT)
              | (1uL << SR_SMF_BIT)
              | (1uL << SR_TOF_BIT)
              ;
  //
  // Wait for the flags to be cleared.
  //
  r       = 0;
  TimeOut = WAIT_TIMEOUT_CYCLES;
  for (;;) {
    if ((OCTOSPI_SR & ((1uL << SR_TEF_BIT) |
                       (1uL << SR_TCF_BIT) |
                       (1uL << SR_SMF_BIT) |
                       (1uL << SR_TOF_BIT))) == 0) {
      break;
    }
    if (--TimeOut == 0u) {
      r = 1;                                    // Error, could not clear flags.
      break;
    }
  }
  return r;
}

/*********************************************************************
*
*       _Cancel
*
*  Function description
*    Stops an ongoing data transfer.
*/
static int _Cancel(void) {
  U32 TimeOut;
  int r;

  r       = 0;
  TimeOut = WAIT_TIMEOUT_CYCLES;
  if ((OCTOSPI_SR & (1uL << SR_BUSY_BIT)) != 0) {
    OCTOSPI_CR |= 1uL << CR_ABORT_BIT;
    _WaitForTransferComplete();
    OCTOSPI_FCR = 1uL << SR_TCF_BIT;
    for (;;) {
      if ((OCTOSPI_SR & (1uL << SR_BUSY_BIT)) == 0) {
        break;
      }
      if (--TimeOut == 0u) {
        r = 1;                                // Error, could not cancel data transfer.
        break;
      }
    }
  }
  return r;
}

/*********************************************************************
*
*       _Reset
*
*  Function description
*    Resets the Octo-SPI controller
*/
static void _Reset(void) {
  RCC_AHB2RSTR2 |=  (1uL << AHB2ENR2_OCTOSPI2EN);
  RCC_AHB2RSTR2 &= ~(1uL << AHB2ENR2_OCTOSPI2EN);
  OCTOSPI_CR   = 0
               | (1uL << CR_EN_BIT)                           // Enable the Octo-SPI unit.
               | (1uL << CR_TCEN_BIT)                         // Enable the timeout for the memory mapped read operations.
               ;
  OCTOSPI_DCR1 = 0
               | (DCR1_DEVSIZE_MAX   << DCR1_DEVSIZE_BIT)     // We set the NOR flash size to maximum since this value is not known at this stage.
               | (2uL                << DCR1_CSHT_BIT)        // The CS signal stays 3 clock cycles high between commands. This setting was taken from an ST sample.
               | (DCR1_MTYP_STANDARD << DCR1_MTYP_BIT)
               ;
  OCTOSPI_DCR2 = 0
               | (_ClkDiv << DCR2_PRESCALER_BIT)              // Configure the clock frequency of the NOR flash.
               ;
  if (_ClkDiv != 0) {                                         // It is not permitted to set the DHQC bit if the prescaler is 0 (see page 944 in [1]).
    OCTOSPI_TCR  = 0
                 | (1uL << TCR_DHQC_BIT)                      // This setting was taken from an ST sample.
                 ;
  }
  OCTOSPI_LPTR = LOW_POWER_TIMEOUT;
#if FS_NOR_HW_USE_OS
  //
  // Clear interrupt flags and enable the interrupt.
  //
  OCTOSPI_CR  |= 0
              | (1uL << CR_APMS_BIT)
              | (1uL << CR_TRIE_BIT)
              | (1uL << CR_TCIE_BIT)
              | (1uL << CR_SMIE_BIT)
              ;
  OCTOSPI_FCR  = 0
               | (1uL << SR_SMF_BIT)
               | (1uL << SR_TOF_BIT)
               | (1uL << SR_FTF_BIT)
               | (1uL << SR_TCF_BIT)
               | (1uL << SR_TEF_BIT)
               ;
  _StatusOSPI = 0;
#endif // FS_NOR_HW_USE_OS
}

/*********************************************************************
*
*       _ReadDataViaCPU
*
*  Function description
*    Transfers data from NOR flash device to CPU.
*
*  Parameters
*    pData      [OUT] Data transferred.
*    NumBytes   Number of bytes to be transferred.
*
*  Return value
*    ==0      OK, data transferred successfully.
*    !=0      An error occurred.
*/
static int _ReadDataViaCPU(U8 * pData, U32 NumBytes) {
  int r;
  U32 DataReg;

  do {
    //
    // Wait for the data to be received.
    //
    r = _WaitForData(NumBytes);
    if (r != 0) {
      break;
    }
    //
    // Read data and store it to destination buffer.
    //
    if (NumBytes >= 4) {
      //
      // Read 4 bytes at a time.
      //
      DataReg = OCTOSPI_DR;
      *pData++ = (U8)DataReg;
      *pData++ = (U8)(DataReg >> 8);
      *pData++ = (U8)(DataReg >> 16);
      *pData++ = (U8)(DataReg >> 24);
      NumBytes -= 4u;
    } else {
      if (NumBytes >= 2) {
        //
        // Read 2 bytes at a time.
        //
        DataReg = OCTOSPI_DR_HWORD;
        *pData++ = (U8)DataReg;
        *pData++ = (U8)(DataReg >> 8);
        NumBytes -= 2u;
      } else {
        //
        // Read single bytes.
        //
        do {
          *pData++ = OCTOSPI_DR_BYTE;
        } while (--NumBytes);
      }
    }
  } while (NumBytes != 0u);
  return r;
}

/*********************************************************************
*
*       _WriteDataViaCPU
*
*  Function description
*    Transfers data from CPU to NOR flash device.
*
*  Parameters
*    pData      [IN] Data to be transferred.
*    NumBytes   Number of bytes to be transferred.
*
*  Return value
*    ==0      OK, data transferred successfully.
*    !=0      An error occurred.
*/
static int _WriteDataViaCPU(const U8 * pData, U32 NumBytes) {
  int r;
  U32 DataReg;

  do {
    //
    // Wait for free space in FIFO.
    //
    r = _WaitForFreeSpace(NumBytes);
    if (r != 0) {
      break;
    }
    //
    // Get the data from source buffer and write it.
    //
    if (NumBytes >= 4u) {
      //
      // Write 4 bytes at a time.
      //
      DataReg  = (U32)*pData++;
      DataReg |= (U32)*pData++ << 8;
      DataReg |= (U32)*pData++ << 16;
      DataReg |= (U32)*pData++ << 24;
      NumBytes -= 4u;
      OCTOSPI_DR = DataReg;
    } else {
      if (NumBytes >= 2) {
        //
        // Write 2 bytes at a time.
        //
        DataReg  = (U32)*pData++;
        DataReg |= (U32)*pData++ << 8;
        NumBytes -= 2u;
        OCTOSPI_DR_HWORD = (U16)DataReg;
      } else {
        //
        // Write single bytes.
        //
        do {
          OCTOSPI_DR_BYTE = *pData++;
        } while (--NumBytes);
      }
    }
  } while (NumBytes != 0u);
  return r;
}

#if FS_NOR_HW_USE_MEM_MODE

/*********************************************************************
*
*       _Map
*
*  Function description
*    Configures the hardware for access to serial NOR flash via system memory.
*/
static int _Map(U8 Unit, const U8 * pCmd, unsigned NumBytesCmd, const U8 * pPara, unsigned NumBytesPara, unsigned NumBytesAddr, U16 BusWidth, unsigned Flags) {
  U32 CfgReg;
  U32 CtrlReg;
  U32 InstMode;
  U32 AddrMode;
  U32 DataMode;
  U32 NumCyclesDummy;
  U32 AddrSize;
  U32 TCfgReg;
  U32 InstReg;
  U32 InstSize;
  U32 NumBytes;
  U32 InstDTR;
  U32 AddrDTR;
  U32 DataDTR;
  U32 MemType;
  U32 DevCfgReg;
  U32 TimeOut;
  int r;
  U32 AltReg;
  U32 NumBytesAlt;
  U32 AltMode;
  U32 AltSize;

  FS_USE_PARA(Unit);
  FS_USE_PARA(pPara);
  //
  // Fill local variables.
  //
  InstReg     = 0;
  AltReg      = 0;
  NumBytesAlt = NumBytesPara - NumBytesAddr;
  //
  // Calculate the transfer mode.
  //
  InstDTR = 0;
  if ((Flags & FS_NOR_HW_FLAG_DTR_CMD) != 0u) {
    InstDTR = 1;
  }
  AddrDTR = 0;
  if ((Flags & FS_NOR_HW_FLAG_DTR_ADDR) != 0u) {
    AddrDTR = 1;
  }
  DataDTR = 0;
  if ((Flags & FS_NOR_HW_FLAG_DTR_DATA) != 0u) {
    DataDTR = 1;
  }
  //
  // Encode the mode and dummy bytes.
  //
  NumCyclesDummy = 0;
  if (NumBytesAlt != 0) {
    NumBytes = NumBytesAlt;
    //
    // Check if a mode byte has to be sent and if yes encode its value.
    //
    if (   ((Flags & FS_NOR_HW_FLAG_MODE_8BIT) != 0u)
        || ((Flags & FS_NOR_HW_FLAG_MODE_4BIT) != 0u)) {                            // OCTOSPI is not able to send a number of mode bits that is not a multiple of eight.
      NumBytes    = NumBytesAlt - 1u;
      NumBytesAlt = 1;                                                              // We never send more than one mode byte.
      if (pPara != NULL) {
        AltReg = (U32)*pPara;
      } else {
        AltReg = 0xFFuL;
      }
    } else {
      NumBytesAlt = 0;
    }
    if (NumBytes != 0u) {
      //
      // The remaining alternate bytes are not sent. Instead, we generate dummy cycles.
      //
      NumCyclesDummy = _CalcNumCycles(FS_BUSWIDTH_GET_ADDR(BusWidth), NumBytes, AddrDTR);
    }
  }
  //
  // Calculate the number of data lines to be used for the transfer.
  //
  InstMode = _CalcTransferMode(FS_BUSWIDTH_GET_CMD(BusWidth), NumBytesCmd);
  AddrMode = _CalcTransferMode(FS_BUSWIDTH_GET_ADDR(BusWidth), NumBytesAddr);
  AltMode  = _CalcTransferMode(FS_BUSWIDTH_GET_ADDR(BusWidth), NumBytesAlt);
  DataMode = _CalcTransferMode(FS_BUSWIDTH_GET_DATA(BusWidth), 1);                  // We read at least one byte.
  //
  // Encode the instruction.
  //
  NumBytes = NumBytesCmd;
  do {
    InstReg <<= 8;
    InstReg  |= (U32)(*pCmd++);
  } while (--NumBytes);
  //
  // Calculate the number of bytes in each command phase.
  //
  InstSize = 0;
  if (NumBytesCmd) {
    InstSize = (NumBytesCmd - 1) & CCR_ISIZE_MASK;
  }
  AddrSize = 0;
  if (NumBytesAddr) {
    AddrSize = (NumBytesAddr - 1) & CCR_ADSIZE_MASK;
  }
  AltSize = 0;
  if (NumBytesAlt) {
    AltSize = (NumBytesAlt - 1) & CCR_ABSIZE_MASK;
  }
  //
  // Configure the operation.
  //
  CfgReg = 0
         | (DataMode << CCR_DMODE_BIT)
         | (DataDTR  << CCR_DDTR_BIT)
         | (AltSize  << CCR_ABSIZE_BIT)
         | (AddrDTR  << CCR_ABDTR_BIT)
         | (AltMode  << CCR_ABMODE_BIT)
         | (AddrSize << CCR_ADSIZE_BIT)
         | (AddrDTR  << CCR_ADDTR_BIT)
         | (AddrMode << CCR_ADMODE_BIT)
         | (InstMode << CCR_IMODE_BIT)
         | (InstDTR  << CCR_IDTR_BIT)
         | (InstSize << CCR_ISIZE_BIT)
         | (DataDTR  << CCR_DQSE_BIT)
         ;
  MemType    = _CalcMemType(Flags);
  DevCfgReg  =   OCTOSPI_DCR1;
  DevCfgReg &= ~(DCR1_MTYP_MASK << DCR1_MTYP_BIT);
  DevCfgReg |=   MemType        << DCR1_MTYP_BIT;
  CtrlReg    =   OCTOSPI_CR;
  CtrlReg   &= ~(CR_FMODE_MASK << CR_FMODE_BIT);
  CtrlReg   |=   CR_FMODE_MMAP << CR_FMODE_BIT;
  TCfgReg    =   OCTOSPI_TCR;
  TCfgReg   &= ~(TCR_DCYC_MASK  << TCR_DCYC_BIT);
  TCfgReg   |=   NumCyclesDummy << TCR_DCYC_BIT;
  //
  // Wait until the unit is ready for the new command.
  //
  TimeOut = WAIT_TIMEOUT_CYCLES;
  for (;;) {
    if ((OCTOSPI_SR & (1uL << SR_BUSY_BIT)) == 0) {
      break;
    }
    if (--TimeOut == 0u) {
      r = 1;                                                                        // Error, OCTOSPI is not ready.
      goto Done;
    }
  }
  r = _ClearFlags();
  if (r != 0) {
    goto Done;                                                                      // Error, could not clear status flags.
  }
  //
  // Start the operation.
  //
  OCTOSPI_DCR1 = DevCfgReg;
  OCTOSPI_CR   = CtrlReg;
  OCTOSPI_ABR  = AltReg;
  OCTOSPI_TCR  = TCfgReg;
  OCTOSPI_AR   = 0;
  OCTOSPI_CCR  = CfgReg;
  OCTOSPI_IR   = InstReg;
Done:
  return r;
}

#endif // FS_NOR_HW_USE_MEM_MODE

/*********************************************************************
*
*       _Control
*
*  Function description
*    Sends a command to serial NOR flash that does not transfer any data.
*/
static int _Control(U8 Unit, const U8 * pCmd, unsigned NumBytesCmd, U8 BusWidth, unsigned Flags) {
  U32 CfgReg;
  U32 CtrlReg;
  U32 InstMode;
  U32 InstReg;
  U32 InstSize;
  U32 NumBytes;
  U32 InstDTR;
  U32 TCfgReg;
  U32 MemType;
  U32 DevCfgReg;
  int r;
  U32 TimeOut;

  FS_USE_PARA(Unit);
  //
  // Calculate the transfer mode.
  //
  InstDTR = 0;
  if ((Flags & FS_NOR_HW_FLAG_DTR_CMD) != 0u) {
    InstDTR = 1;
  }
  //
  // Fill local variables.
  //
  InstReg  = 0;
  InstMode = _CalcTransferMode(BusWidth, NumBytesCmd);
  //
  // Encode the instruction.
  //
  NumBytes = NumBytesCmd;
  do {
    InstReg <<= 8;
    InstReg  |= (U32)(*pCmd++);
  } while (--NumBytes);
  //
  // Calculate the number of bytes in the instruction.
  //
  InstSize = 0;
  if (NumBytesCmd) {
    InstSize = (NumBytesCmd - 1) & CCR_ISIZE_MASK;
  }
  //
  // Configure the operation.
  //
  CfgReg  = 0
          | (InstMode << CCR_IMODE_BIT)
          | (InstDTR  << CCR_IDTR_BIT)
          | (InstSize << CCR_ISIZE_BIT)
          ;
  MemType    = _CalcMemType(Flags);
  DevCfgReg  =   OCTOSPI_DCR1;
  DevCfgReg &= ~(DCR1_MTYP_MASK << DCR1_MTYP_BIT);
  DevCfgReg |=   MemType        << DCR1_MTYP_BIT;
  CtrlReg    =   OCTOSPI_CR;
  CtrlReg   &= ~(CR_FMODE_MASK  << CR_FMODE_BIT);
  CtrlReg   |=   CR_FMODE_WRITE << CR_FMODE_BIT;
  TCfgReg    =   OCTOSPI_TCR;
  TCfgReg   &= ~(TCR_DCYC_MASK  << TCR_DCYC_BIT);
  //
  // Wait until the unit is ready for the new command.
  //
  TimeOut = WAIT_TIMEOUT_CYCLES;
  for (;;) {
    if ((OCTOSPI_SR & (1uL << SR_BUSY_BIT)) == 0) {
      break;
    }
    if (--TimeOut == 0u) {
      r = 1;                                                // Error, OCTOSPI is not ready.
      goto Done;
    }
  }
  //
  // Execute the command.
  //
  r = _ClearFlags();
  if (r != 0) {
    goto Done;                                              // Error, could not clear status flags.
  }
  OCTOSPI_DCR1 = DevCfgReg;
  OCTOSPI_CR   = CtrlReg;
  OCTOSPI_DLR  = 0;
  OCTOSPI_ABR  = 0;
  OCTOSPI_CCR  = CfgReg;
  OCTOSPI_TCR  = TCfgReg;
  OCTOSPI_IR   = InstReg;
  //
  // Wait until the command has been completed.
  //
  TimeOut = WAIT_TIMEOUT_CYCLES;
  for (;;) {
    if ((OCTOSPI_SR & (1uL << SR_BUSY_BIT)) == 0) {
      break;
    }
    if (--TimeOut == 0u) {
      r = 1;                                                // Error, OCTOSPI is not ready.
      break;
    }
  }
Done:
  return r;
}

/*********************************************************************
*
*       _Read
*
*  Function description
*    Transfers data from NOR flash to MCU.
*/
static int _Read(U8 Unit, const U8 * pCmd, unsigned NumBytesCmd, const U8 * pPara, unsigned NumBytesPara, unsigned NumBytesAddr, U8 * pData, unsigned NumBytesData, U16 BusWidth, unsigned Flags) {
  U32 AddrReg;
  U32 AltReg;
  U32 CfgReg;
  U32 CtrlReg;
  U32 DataMode;
  U32 AddrMode;
  U32 AltMode;
  U32 InstMode;
  U32 AltSize;
  U32 AddrSize;
  U32 NumBytes;
  U32 NumBytesAlt;
  U32 NumBytesToRead;
  U32 InstReg;
  U32 InstSize;
  U32 InstDTR;
  U32 AddrDTR;
  U32 DataDTR;
  U32 NumCyclesDummy;
  U32 TCfgReg;
  int r;
  int Result;
  U32 MemType;
  U32 DevCfgReg;
  U32 TimeOut;

  FS_USE_PARA(Unit);
  //
  // Calculate the transfer mode.
  //
  InstDTR = 0;
  if ((Flags & FS_NOR_HW_FLAG_DTR_CMD) != 0u) {
    InstDTR = 1;
  }
  AddrDTR = 0;
  if ((Flags & FS_NOR_HW_FLAG_DTR_ADDR) != 0u) {
    AddrDTR = 1;
  }
  DataDTR = 0;
  if ((Flags & FS_NOR_HW_FLAG_DTR_DATA) != 0u) {
    DataDTR = 1;
  }
  //
  // Fill local variables.
  //
  InstReg     = 0;
  AddrReg     = 0;
  AltReg      = 0;
  NumBytesAlt = NumBytesPara - NumBytesAddr;
  //
  // Encode the instruction.
  //
  NumBytes = NumBytesCmd;
  do {
    InstReg <<= 8;
    InstReg  |= (U32)(*pCmd++);
  } while (--NumBytes);
  //
  // Encode the address.
  //
  if (NumBytesAddr) {
    NumBytes = NumBytesAddr;
    do {
      AddrReg <<= 8;
      AddrReg  |= (U32)(*pPara++);
    } while (--NumBytes);
  }
  //
  // Encode the dummy and mode bytes.
  //
  NumCyclesDummy = 0;
  if (NumBytesAlt != 0) {
    NumBytes = NumBytesAlt;
    //
    // Check if a mode byte has to be sent and if yes encode its value.
    //
    if (   ((Flags & FS_NOR_HW_FLAG_MODE_8BIT) != 0u)
        || ((Flags & FS_NOR_HW_FLAG_MODE_4BIT) != 0u)) {                            // OCTOSPI is not able to send a number of mode bits that is not a multiple of eight.
      NumBytes    = NumBytesAlt - 1u;
      NumBytesAlt = 1;                                                              // We never send more than one mode byte.
      if (pPara != NULL) {
        AltReg = (U32)*pPara;
      } else {
        AltReg = 0xFFuL;
      }
    } else {
      NumBytesAlt = 0;
    }
    if (NumBytes != 0u) {
      //
      // The remaining alternate bytes are not sent. Instead, we generate dummy cycles.
      //
      NumCyclesDummy = _CalcNumCycles(FS_BUSWIDTH_GET_ADDR(BusWidth), NumBytes, AddrDTR);
    }
  }
  //
  // Calculate the number of data lines to be used for the transfer.
  //
  InstMode = _CalcTransferMode(FS_BUSWIDTH_GET_CMD(BusWidth), NumBytesCmd);
  AddrMode = _CalcTransferMode(FS_BUSWIDTH_GET_ADDR(BusWidth), NumBytesAddr);
  AltMode  = _CalcTransferMode(FS_BUSWIDTH_GET_ADDR(BusWidth), NumBytesAlt);
  DataMode = _CalcTransferMode(FS_BUSWIDTH_GET_DATA(BusWidth), NumBytesData);
  //
  // Calculate the number of bytes in each command phase.
  //
  InstSize = 0;
  if (NumBytesCmd) {
    InstSize = (NumBytesCmd - 1) & CCR_ISIZE_MASK;
  }
  AddrSize = 0;
  if (NumBytesAddr) {
    AddrSize = (NumBytesAddr - 1) & CCR_ADSIZE_MASK;
  }
  AltSize = 0;
  if (NumBytesAlt) {
    AltSize = (NumBytesAlt - 1) & CCR_ABSIZE_MASK;
  }
  //
  // Configure the operation.
  //
  CfgReg = 0
         | (DataMode << CCR_DMODE_BIT)
         | (DataDTR  << CCR_DDTR_BIT)
         | (AltSize  << CCR_ABSIZE_BIT)
         | (AddrDTR  << CCR_ABDTR_BIT)
         | (AltMode  << CCR_ABMODE_BIT)
         | (AddrSize << CCR_ADSIZE_BIT)
         | (AddrDTR  << CCR_ADDTR_BIT)
         | (AddrMode << CCR_ADMODE_BIT)
         | (InstMode << CCR_IMODE_BIT)
         | (InstDTR  << CCR_IDTR_BIT)
         | (InstSize << CCR_ISIZE_BIT)
         | (DataDTR  << CCR_DQSE_BIT)
         ;
  MemType    = _CalcMemType(Flags);
  DevCfgReg  =   OCTOSPI_DCR1;
  DevCfgReg &= ~(DCR1_MTYP_MASK << DCR1_MTYP_BIT);
  DevCfgReg |=   MemType        << DCR1_MTYP_BIT;
  CtrlReg    =   OCTOSPI_CR;
  CtrlReg   &= ~(CR_FMODE_MASK  << CR_FMODE_BIT);
  CtrlReg   |=   CR_FMODE_READ  << CR_FMODE_BIT;
  TCfgReg    =   OCTOSPI_TCR;
  TCfgReg   &= ~(TCR_DCYC_MASK  << TCR_DCYC_BIT);
  TCfgReg   |=   NumCyclesDummy << TCR_DCYC_BIT;
  //
  // Wait until the unit is ready for the new command.
  //
  TimeOut = WAIT_TIMEOUT_CYCLES;
  for (;;) {
    if ((OCTOSPI_SR & (1uL << SR_BUSY_BIT)) == 0) {
      break;
    }
    if (--TimeOut == 0u) {
      r = 1;                              // Error, OCTOSPI is not ready.
      goto Done;
    }
  }
  //
  // Execute the command.
  //
  r = _ClearFlags();
  if (r != 0) {
    goto Done;                            // Error, could not clear status flags.
  }
#if FS_NOR_HW_USE_OS
  _StatusOSPI = 0;
#endif // FS_NOR_HW_USE_OS
  NumBytesToRead = NumBytesData - 1;        // We have to subtract 1 because 0 means "read 1 byte".
  if (NumBytesData != 0u) {
    OCTOSPI_DLR = NumBytesToRead;
  }
  OCTOSPI_DCR1 = DevCfgReg;
  OCTOSPI_CR   = CtrlReg;
  OCTOSPI_ABR  = AltReg;
  OCTOSPI_CCR  = CfgReg;
  OCTOSPI_TCR  = TCfgReg;
  OCTOSPI_IR   = InstReg;
  if (NumBytesAddr != 0u) {
    OCTOSPI_AR = AddrReg;
  }
  //
  // Receive the data from NOR flash device.
  //
  r = 0;
  if (NumBytesData != 0u) {
    Result = _ReadDataViaCPU(pData, NumBytesData);
    if (Result != 0) {
      r = 1;
    }
  }
  //
  // Wait until the data transfer has been completed.
  //
  Result = _WaitForTransferComplete();
  if (Result != 0) {
    r = 1;
  }
Done:
  return r;
}

