jfazekas21/blackBird-ESP32-S3/source/components/JFS/Sample/Driver/NOR/ST_STM32U585/FS_NOR_HW_SPIFI_STM32U585_ST_B_U585I_IOT02A_Discovery.c
/*********************************************************************
*
*       _Write
*
*  Function description
*    Transfers data from MCU to NOR flash.
*/
static int _Write(U8 Unit, const U8 * pCmd, unsigned NumBytesCmd, const U8 * pPara, unsigned NumBytesPara, unsigned NumBytesAddr, const U8 * pData, unsigned NumBytesData, U16 BusWidth, unsigned Flags) {
  U32 AddrReg;
  U32 AltReg;
  U32 CfgReg;
  U32 CtrlReg;
  U32 DataMode;
  U32 AddrMode;
  U32 AltMode;
  U32 InstMode;
  U32 AddrSize;
  U32 AltSize;
  U32 NumBytes;
  U32 NumBytesAlt;
  U32 InstReg;
  U32 InstDTR;
  U32 AddrDTR;
  U32 DataDTR;
  int r;
  int Result;
  U32 InstSize;
  U32 TCfgReg;
  U32 MemType;
  U32 DevCfgReg;
  U32 TimeOut;

  FS_USE_PARA(Unit);
  //
  // Calculate the transfer mode.
  //
  InstDTR = 0;
  if ((Flags & FS_NOR_HW_FLAG_DTR_CMD) != 0u) {
    InstDTR = 1;
  }
  AddrDTR = 0;
  if ((Flags & FS_NOR_HW_FLAG_DTR_ADDR) != 0u) {
    AddrDTR = 1;
  }
  DataDTR = 0;
  if ((Flags & FS_NOR_HW_FLAG_DTR_DATA) != 0u) {
    DataDTR = 1;
  }
  //
  // Fill local variables.
  //
  InstReg     = 0;
  AddrReg     = 0;
  AltReg      = 0;
  NumBytesAlt = NumBytesPara - NumBytesAddr;
  //
  // Encode the instruction.
  //
  NumBytes = NumBytesCmd;
  do {
    InstReg <<= 8;
    InstReg  |= (U32)(*pCmd++);
  } while (--NumBytes);
  //
  // Encode the address.
  //
  if (NumBytesAddr) {
    NumBytes = NumBytesAddr;
    do {
      AddrReg <<= 8;
      AddrReg  |= (U32)(*pPara++);
    } while (--NumBytes);
  }
  //
  // Encode the dummy and mode bytes.
  //
  if (NumBytesPara > NumBytesAddr) {
    NumBytes = NumBytesAlt;
    do {
      AltReg <<= 8;
      AltReg  |= (U32)(*pPara++);
    } while (--NumBytes);
  }
  //
  // Calculate the number of data lines to be used for the transfer.
  //
  InstMode = _CalcTransferMode(FS_BUSWIDTH_GET_CMD(BusWidth), NumBytesCmd);
  AddrMode = _CalcTransferMode(FS_BUSWIDTH_GET_ADDR(BusWidth), NumBytesAddr);
  AltMode  = _CalcTransferMode(FS_BUSWIDTH_GET_ADDR(BusWidth), NumBytesAlt);
  DataMode = _CalcTransferMode(FS_BUSWIDTH_GET_DATA(BusWidth), NumBytesData);
  //
  // Calculate the number of bytes in each command phase.
  //
  InstSize = 0;
  if (NumBytesCmd) {
    InstSize = (NumBytesCmd - 1) & CCR_ISIZE_MASK;
  }
  AddrSize = 0;
  if (NumBytesAddr) {
    AddrSize = NumBytesAddr - 1;
  }
  AltSize = 0;
  if (NumBytesAlt) {
    AltSize = NumBytesAlt - 1;
  }
  //
  // Configure the operation.
  //
  CfgReg = 0
         | (DataMode << CCR_DMODE_BIT)
         | (DataDTR  << CCR_DDTR_BIT)
         | (AltSize  << CCR_ABSIZE_BIT)
         | (AddrDTR  << CCR_ABDTR_BIT)
         | (AltMode  << CCR_ABMODE_BIT)
         | (AddrSize << CCR_ADSIZE_BIT)
         | (AddrDTR  << CCR_ADDTR_BIT)
         | (AddrMode << CCR_ADMODE_BIT)
         | (InstMode << CCR_IMODE_BIT)
         | (InstDTR  << CCR_IDTR_BIT)
         | (InstSize << CCR_ISIZE_BIT)
         ;
  MemType    = _CalcMemType(Flags);
  DevCfgReg  =   OCTOSPI_DCR1;
  DevCfgReg &= ~(DCR1_MTYP_MASK << DCR1_MTYP_BIT);
  DevCfgReg |=   MemType        << DCR1_MTYP_BIT;
  CtrlReg    =   OCTOSPI_CR;
  CtrlReg   &= ~(CR_FMODE_MASK  << CR_FMODE_BIT);
  CtrlReg   |=   CR_FMODE_WRITE << CR_FMODE_BIT;
  TCfgReg    =   OCTOSPI_TCR;
  TCfgReg   &= ~(TCR_DCYC_MASK  << TCR_DCYC_BIT);
  //
  // Wait until the unit is ready for the new command.
  //
  TimeOut = WAIT_TIMEOUT_CYCLES;
  for (;;) {
    if ((OCTOSPI_SR & (1uL << SR_BUSY_BIT)) == 0) {
      break;
    }
    if (--TimeOut == 0u) {
      r = 1;                              // Error, OCTOSPI is not ready.
      goto Done;
    }
  }
  //
  // Execute the command.
  //
#if FS_NOR_HW_USE_OS
  _StatusOSPI = 0;
#endif // FS_NOR_HW_USE_OS
  r = _ClearFlags();
  if (r != 0) {
    goto Done;                            // Error, could not clear status flags.
  }
  if (NumBytesData != 0u) {
    OCTOSPI_DLR = NumBytesData - 1;       // 0 means "write 1 byte".
  }
  OCTOSPI_DCR1 = DevCfgReg;
  OCTOSPI_CR   = CtrlReg;
  OCTOSPI_ABR  = AltReg;
  OCTOSPI_CCR  = CfgReg;
  OCTOSPI_TCR  = TCfgReg;
  OCTOSPI_IR   = InstReg;
  if (NumBytesAddr != 0u) {
    OCTOSPI_AR = AddrReg;
  }
  //
  // Send data to the NOR flash device.
  //
  r = 0;
  if (NumBytesData != 0u) {
    Result = _WriteDataViaCPU(pData, NumBytesData);
    if (Result != 0) {
      r = 1;
    }
  }
  //
  // Wait until the data transfer has been completed.
  //
  Result = _WaitForTransferComplete();
  if (Result != 0) {
    r = 1;
  }
Done:
  return r;
}

#if FS_NOR_HW_USE_OS

/*********************************************************************
*
*       _Poll
*
*  Function description
*    Checks periodically the value of a status flag.
*
*  Parameters
*    Unit           Index of the hardware layer (0-based).
*    pCmd           [IN] Code of the command to be sent. Cannot be NULL.
*    NumBytesCmd    Number of bytes in the command code. Cannot be 0.
*    pPara          [IN] Command parameters (address and dummy bytes). Can be NULL.
*    NumBytesPara   Total number of address and dummy bytes to be sent. Can be 0.
*    NumBytesAddr   Number of address bytes to be send. Can be 0.
*    BitPos         Position of the bit to be checked.
*    BitValue       Value of the bit to wait for.
*    Delay          Number of clock cycles to wait between two queries.
*    TimeOut_ms     Maximum number of milliseconds to wait for the bit to be set.
*    BusWidth       Number of data lines to be used for the data transfer.
*    Flags          Options for the data exchange.
*
*  Return value
*    > 0    Timeout occurred.
*    ==0    OK, bit set to specified value.
*    < 0    Feature not supported.
*/
static int _Poll(U8 Unit, const U8 * pCmd, unsigned NumBytesCmd, const U8 * pPara, unsigned NumBytesPara, unsigned NumBytesAddr, U8 BitPos, U8 BitValue, U32 Delay, U32 TimeOut_ms, U16 BusWidth, unsigned Flags) {
  int r;
  U32 CfgReg;
  U32 CtrlReg;
  U32 DataMode;
  U32 InstMode;
  U32 NumBytes;
  U32 NumBytesData;
  U32 DataMask;
  U32 DataMatch;
  U32 Status;
  U32 InstReg;
  U32 AddrReg;
  U32 AltReg;
  U32 NumBytesAlt;
  U32 AddrMode;
  U32 AltMode;
  U32 AddrSize;
  U32 AltSize;
  U32 InstSize;
  U32 InstDTR;
  U32 AddrDTR;
  U32 DataDTR;
  U32 TCfgReg;
  U32 NumCyclesDummy;
  U32 MemType;
  U32 DevCfgReg;
  U32 TimeOut;

  FS_USE_PARA(Unit);
  //
  // Calculate the transfer mode.
  //
  InstDTR = 0;
  if ((Flags & FS_NOR_HW_FLAG_DTR_CMD) != 0u) {
    InstDTR = 1;
  }
  AddrDTR = 0;
  if ((Flags & FS_NOR_HW_FLAG_DTR_ADDR) != 0u) {
    AddrDTR = 1;
  }
  DataDTR = 0;
  if ((Flags & FS_NOR_HW_FLAG_DTR_DATA) != 0u) {
    DataDTR = 1;
  }
  //
  // Fill local variables.
  //
  InstReg        = 0;
  AddrReg        = 0;
  AltReg         = 0;
  DataMask       = 1uL           << BitPos;
  DataMatch      = (U32)BitValue << BitPos;
  Delay        <<= 4;                                                               // 16 clock cycles are required to transfer 2 bytes.
  NumBytesData   = 1;                                                               // The response consists of only one byte.
  NumBytesAlt    = NumBytesPara - NumBytesAddr;
  //
  // Encode the instruction.
  //
  NumBytes = NumBytesCmd;
  do {
    InstReg <<= 8;
    InstReg  |= (U32)(*pCmd++);
  } while (--NumBytes);
  //
  // Encode the address.
  //
  if (NumBytesAddr) {
    NumBytes = NumBytesAddr;
    do {
      AddrReg <<= 8;
      AddrReg  |= (U32)(*pPara++);
    } while (--NumBytes);
  }
  //
  // Encode the mode and dummy bytes.
  //
  NumCyclesDummy = 0;
  if (NumBytesAlt != 0) {
    NumBytes = NumBytesAlt;
    //
    // Check if a mode byte has to be sent and if yes encode its value.
    //
    if (   ((Flags & FS_NOR_HW_FLAG_MODE_8BIT) != 0u)
        || ((Flags & FS_NOR_HW_FLAG_MODE_4BIT) != 0u)) {                            // OCTOSPI is not able to send a number of mode bits that is not a multiple of eight.
      NumBytes    = NumBytesAlt - 1u;
      NumBytesAlt = 1;                                                              // We never send more than one mode byte.
      if (pPara != NULL) {
        AltReg = (U32)*pPara;
      } else {
        AltReg = 0xFFuL;
      }
    } else {
      NumBytesAlt = 0;
    }
    if (NumBytes != 0u) {
      //
      // The remaining alternate bytes are not sent. Instead, we generate dummy cycles.
      //
      NumCyclesDummy = _CalcNumCycles(FS_BUSWIDTH_GET_ADDR(BusWidth), NumBytes, AddrDTR);
    }
  }
  //
  // Calculate the number of data lines to be used for the transfer.
  //
  InstMode = _CalcTransferMode(FS_BUSWIDTH_GET_CMD(BusWidth), NumBytesCmd);
  AddrMode = _CalcTransferMode(FS_BUSWIDTH_GET_ADDR(BusWidth), NumBytesAddr);
  AltMode  = _CalcTransferMode(FS_BUSWIDTH_GET_ADDR(BusWidth), NumBytesAlt);
  DataMode = _CalcTransferMode(FS_BUSWIDTH_GET_DATA(BusWidth), NumBytesData);
  //
  // Calculate the number of bytes in each command phase.
  //
  InstSize = 0;
  if (NumBytesCmd) {
    InstSize = (NumBytesCmd - 1) & CCR_ISIZE_MASK;
  }
  AddrSize = 0;
  if (NumBytesAddr) {
    AddrSize = (NumBytesAddr - 1) & CCR_ADSIZE_MASK;
  }
  AltSize = 0;
  if (NumBytesAlt) {
    AltSize = (NumBytesAlt - 1) & CCR_ABSIZE_MASK;
  }
  //
  // Configure the operation.
  //
  CfgReg = 0
         | (DataMode << CCR_DMODE_BIT)
         | (DataDTR  << CCR_DDTR_BIT)
         | (AltSize  << CCR_ABSIZE_BIT)
         | (AddrDTR  << CCR_ABDTR_BIT)
         | (AltMode  << CCR_ABMODE_BIT)
         | (AddrSize << CCR_ADSIZE_BIT)
         | (AddrDTR  << CCR_ADDTR_BIT)
         | (AddrMode << CCR_ADMODE_BIT)
         | (InstMode << CCR_IMODE_BIT)
         | (InstDTR  << CCR_IDTR_BIT)
         | (InstSize << CCR_ISIZE_BIT)
         ;
  MemType    = _CalcMemType(Flags);
  DevCfgReg  =   OCTOSPI_DCR1;
  DevCfgReg &= ~(DCR1_MTYP_MASK << DCR1_MTYP_BIT);
  DevCfgReg |=   MemType        << DCR1_MTYP_BIT;
  CtrlReg    =   OCTOSPI_CR;
  CtrlReg   &= ~(CR_FMODE_MASK << CR_FMODE_BIT);
  CtrlReg   |=   CR_FMODE_POLL << CR_FMODE_BIT;
  TCfgReg    = OCTOSPI_TCR;
  TCfgReg   &= ~(TCR_DCYC_MASK  << TCR_DCYC_BIT);
  TCfgReg   |=   NumCyclesDummy << TCR_DCYC_BIT;
  //
  // Wait until the unit is ready for the new command.
  //
  TimeOut = WAIT_TIMEOUT_CYCLES;
  for (;;) {
    if ((OCTOSPI_SR & (1uL << SR_BUSY_BIT)) == 0) {
      break;
    }
    if (--TimeOut == 0u) {
      r = 1;                              // Error, OCTOSPI is not ready.
      goto Done;
    }
  }
  //
  // Start the poll operation. The end of operation is signaled via interrupt.
  //
  r = _ClearFlags();
  if (r != 0) {
    goto Done;                            // Error, could not clear status flags.
  }
  _StatusOSPI = 0;
  if (NumBytesData) {
    OCTOSPI_DLR = NumBytesData - 1;       // 0 means "read 1 byte".
  }
  OCTOSPI_DCR1  = DevCfgReg;
  OCTOSPI_ABR   = AltReg;
  OCTOSPI_CR    = CtrlReg;
  OCTOSPI_PSMKR = DataMask;
  OCTOSPI_PSMAR = DataMatch;
  OCTOSPI_PIR   = Delay;
  OCTOSPI_FCR   = 1uL << SR_SMF_BIT;
  OCTOSPI_CCR   = CfgReg;
  OCTOSPI_TCR   = TCfgReg;
  OCTOSPI_IR    = InstReg;
  if (NumBytesAddr != 0u) {
    OCTOSPI_AR = AddrReg;
  }
  for (;;) {
    Status = _StatusOSPI;
    if (Status & (1uL << SR_SMF_BIT)) {
      r = 0;                                // Bit set to the requested value.
      break;
    }
    r = FS_X_OS_Wait(TimeOut_ms);
    if (r != 0) {
      //
      // The timeout has expired. Cancel the polling operation.
      //
      (void)_Cancel();
      r = 1;                                // A timeout occurred.
      break;
    }
  }
Done:
  return r;
}

#endif // FS_NOR_HW_USE_OS

/*********************************************************************
*
*      Public code (via callback)
*
**********************************************************************
*/

/*********************************************************************
*
*       _HW_Init
*
*  Function description
*    Initializes the SPI hardware.
*
*  Parameters
*    Unit       Index of the hardware layer (0-based).
*
*  Return value
*    > 0      OK, frequency of the SPI clock in Hz.
*    ==0      An error occurred.
*/
static int _HW_Init(U8 Unit) {
  U32 Freq_Hz;

  FS_USE_PARA(Unit);
  //
  // Select the clock source for OCTOSPI.
  //
  RCC_CCIPR2 &= ~(CCIPR2_OCTOSPISEL_MASK << CCIPR2_OCTOSPISEL_BIT);
  //
  // Enable the clocks of peripherals and reset them.
  //
  RCC_AHB2ENR1 |= 0
               | (1uL << AHB2ENR1_GPIOFEN)
               | (1uL << AHB2ENR1_GPIOHEN)
               | (1uL << AHB2ENR1_GPIOIEN)
               | (1uL << AHB2ENR1_OCTOSPIMEN)
               ;
  RCC_AHB1ENR  |= 1uL << AHB1ENR_DCACHE1EN;         // Acc. to [1] it is necessary to enable this clock even when the data cache is not used.
  RCC_AHB2ENR2 |= 1uL << AHB2ENR2_OCTOSPI2EN;
  //
  // Wait for the unit to exit reset.
  //
  for (;;) {
    if ((RCC_AHB2RSTR2 & (1uL << AHB2ENR2_OCTOSPI2EN)) == 0) {
      break;
    }
  }
  //
  // CS is an output signal and is controlled by the OCTOSPI unit.
  //
  GPIOI_MODER   &= ~(MODER_MASK   << ( NOR_CS_BIT       << 1));
  GPIOI_MODER   |=  (MODER_ALT    << ( NOR_CS_BIT       << 1));
  GPIOI_AFRL    &= ~(AFR_MASK     << ((NOR_CS_BIT - 0)  << 2));
  GPIOI_AFRL    |=  (0x5uL        << ((NOR_CS_BIT - 0)  << 2));
  GPIOI_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_CS_BIT       << 1));
  GPIOI_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_CS_BIT       << 1));
  //
  // DQS is an output signal and is controlled by the OCTOSPI unit.
  //
  GPIOF_MODER   &= ~(MODER_MASK   << ( NOR_DQS_BIT      << 1));
  GPIOF_MODER   |=  (MODER_ALT    << ( NOR_DQS_BIT      << 1));
  GPIOF_AFRH    &= ~(AFR_MASK     << ((NOR_DQS_BIT - 8) << 2));
  GPIOF_AFRH    |=  (0x5uL        << ((NOR_DQS_BIT - 8) << 2));
  GPIOF_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_DQS_BIT      << 1));
  GPIOF_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_DQS_BIT      << 1));
  //
  // CLK is an output signal controlled by the OCTOSPI unit.
  //
  GPIOF_MODER   &= ~(MODER_MASK   << ( NOR_CLK_BIT      << 1));
  GPIOF_MODER   |=  (MODER_ALT    << ( NOR_CLK_BIT      << 1));
  GPIOF_AFRL    &= ~(AFR_MASK     << ((NOR_CLK_BIT - 0) << 2));
  GPIOF_AFRL    |=  (0x5uL        << ((NOR_CLK_BIT - 0) << 2));
  GPIOF_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_CLK_BIT      << 1));
  GPIOF_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_CLK_BIT      << 1));
  //
  // D0 is an input/output signal controlled by the OCTOSPI unit.
  //
  GPIOF_MODER   &= ~(MODER_MASK   << ( NOR_D0_BIT      << 1));
  GPIOF_MODER   |=  (MODER_ALT    << ( NOR_D0_BIT      << 1));
  GPIOF_AFRL    &= ~(AFR_MASK     << ((NOR_D0_BIT - 0) << 2));
  GPIOF_AFRL    |=  (0x5uL        << ((NOR_D0_BIT - 0) << 2));
  GPIOF_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D0_BIT      << 1));
  GPIOF_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D0_BIT      << 1));
  //
  // D1 is an input/output signal controlled by the OCTOSPI unit.
  //
  GPIOF_MODER   &= ~(MODER_MASK   << ( NOR_D1_BIT      << 1));
  GPIOF_MODER   |=  (MODER_ALT    << ( NOR_D1_BIT      << 1));
  GPIOF_AFRL    &= ~(AFR_MASK     << ((NOR_D1_BIT - 0) << 2));
  GPIOF_AFRL    |=  (0x5uL        << ((NOR_D1_BIT - 0) << 2));
  GPIOF_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D1_BIT      << 1));
  GPIOF_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D1_BIT      << 1));
  //
  // D2 is an input/output signal and is controlled by the OCTOSPI unit.
  //
  GPIOF_MODER   &= ~(MODER_MASK   << ( NOR_D2_BIT      << 1));
  GPIOF_MODER   |=  (MODER_ALT    << ( NOR_D2_BIT      << 1));
  GPIOF_AFRL    &= ~(AFR_MASK     << ((NOR_D2_BIT - 0) << 2));
  GPIOF_AFRL    |=  (0x5uL        << ((NOR_D2_BIT - 0) << 2));
  GPIOF_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D2_BIT      << 1));
  GPIOF_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D2_BIT      << 1));
  //
  // D3 is an output signal and is controlled by the OCTOSPI unit.
  //
  GPIOF_MODER   &= ~(MODER_MASK   << ( NOR_D3_BIT      << 1));
  GPIOF_MODER   |=  (MODER_ALT    << ( NOR_D3_BIT      << 1));
  GPIOF_AFRL    &= ~(AFR_MASK     << ((NOR_D3_BIT - 0) << 2));
  GPIOF_AFRL    |=  (0x5uL        << ((NOR_D3_BIT - 0) << 2));
  GPIOF_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D3_BIT      << 1));
  GPIOF_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D3_BIT      << 1));
  //
  // D4 is an output signal and is controlled by the OCTOSPI unit.
  //
  GPIOH_MODER   &= ~(MODER_MASK   << ( NOR_D4_BIT      << 1));
  GPIOH_MODER   |=  (MODER_ALT    << ( NOR_D4_BIT      << 1));
  GPIOH_AFRH    &= ~(AFR_MASK     << ((NOR_D4_BIT - 8) << 2));
  GPIOH_AFRH    |=  (0x5uL        << ((NOR_D4_BIT - 8) << 2));
  GPIOH_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D4_BIT      << 1));
  GPIOH_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D4_BIT      << 1));
  //
  // D5 is an output signal and is controlled by the OCTOSPI unit.
  //
  GPIOH_MODER   &= ~(MODER_MASK   << ( NOR_D5_BIT      << 1));
  GPIOH_MODER   |=  (MODER_ALT    << ( NOR_D5_BIT      << 1));
  GPIOH_AFRH    &= ~(AFR_MASK     << ((NOR_D5_BIT - 8) << 2));
  GPIOH_AFRH    |=  (0x5uL        << ((NOR_D5_BIT - 8) << 2));
  GPIOH_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D5_BIT      << 1));
  GPIOH_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D5_BIT      << 1));
  //
  // D6 is an output signal and is controlled by the OCTOSPI unit.
  //
  GPIOH_MODER   &= ~(MODER_MASK   << ( NOR_D6_BIT      << 1));
  GPIOH_MODER   |=  (MODER_ALT    << ( NOR_D6_BIT      << 1));
  GPIOH_AFRH    &= ~(AFR_MASK     << ((NOR_D6_BIT - 8) << 2));
  GPIOH_AFRH    |=  (0x5uL        << ((NOR_D6_BIT - 8) << 2));
  GPIOH_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D6_BIT      << 1));
  GPIOH_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D6_BIT      << 1));
  //
  // D7 is an output signal and is controlled by the OCTOSPI unit.
  //
  GPIOH_MODER   &= ~(MODER_MASK   << ( NOR_D7_BIT      << 1));
  GPIOH_MODER   |=  (MODER_ALT    << ( NOR_D7_BIT      << 1));
  GPIOH_AFRH    &= ~(AFR_MASK     << ((NOR_D7_BIT - 8) << 2));
  GPIOH_AFRH    |=  (0x5uL        << ((NOR_D7_BIT - 8) << 2));
  GPIOH_OSPEEDR &= ~(OSPEEDR_MASK << ( NOR_D7_BIT      << 1));
  GPIOH_OSPEEDR |=  (OSPEEDR_HIGH << ( NOR_D7_BIT      << 1));
#if FS_NOR_HW_USE_OS
  //
  // Disable the interrupt and configure the priority.
  //
  NVIC_DisableIRQ(OCTOSPI2_IRQn);
  NVIC_SetPriority(OCTOSPI2_IRQn, OCTOSPI_PRIO);
#endif // FS_NOR_HW_USE_OS
  //
  // Initialize the Octo-SPI controller.
  //
  Freq_Hz = FS_NOR_HW_NOR_CLK_HZ;
  _ClkDiv = _CalcClockDivider(&Freq_Hz);
  _Reset();
#if FS_NOR_HW_USE_OS
  NVIC_EnableIRQ(OCTOSPI2_IRQn);
#endif // FS_NOR_HW_USE_OS
  return (int)Freq_Hz;
}

/*********************************************************************
*
*       _HW_Unmap
*
*  Function description
*    Configures the hardware for direct access to serial NOR flash.
*
*  Parameters
*    Unit       Index of the hardware layer (0-based).
*/
static void _HW_Unmap(U8 Unit) {
  FS_USE_PARA(Unit);

  //
  // Cancel the memory mode so that the BUSY bit goes to 0
  // and we can write to OCTOSPI_CCR register.
  //
  if ((OCTOSPI_CR & (CR_FMODE_MASK << CR_FMODE_BIT)) == (CR_FMODE_MMAP << CR_FMODE_BIT)) {
    _Cancel();
  }
  _Reset();
}

#if FS_NOR_HW_USE_MEM_MODE

/*********************************************************************
*
*       _HW_Map
*
*  Function description
*    Configures the hardware for access to serial NOR flash via system memory.
*
*  Parameters
*    Unit           Index of the hardware layer (0-based).
*    ReadCmd        Code of the command to be used for reading the data.
*    NumBytesAddr   Number of address bytes to be used for the read command.
*    NumBytesDummy  Number of dummy bytes to be sent after the read command.
*    BusWidth       Number of data lines to be used for the data transfer.
*/
static void _HW_Map(U8 Unit, U8 ReadCmd, unsigned NumBytesAddr, unsigned NumBytesDummy, U16 BusWidth) {
  unsigned NumBytesPara;

  NumBytesPara = NumBytesAddr + NumBytesDummy;
  (void)_Map(Unit, &ReadCmd, sizeof(ReadCmd), NULL, NumBytesPara, NumBytesAddr, BusWidth, 0);
}

#endif // FS_NOR_HW_USE_MEM_MODE

/*********************************************************************
*
*       _HW_Control
*
*  Function description
*    Sends a command to serial NOR flash that does not transfer any data.
*
*  Parameters
*    Unit           Index of the hardware layer (0-based).
*    Cmd            Code of the command to be sent.
*    BusWidth       Number of data lines to be used for sending the command.
*/
static void _HW_Control(U8 Unit, U8 Cmd, U8 BusWidth) {
  (void)_Control(Unit, &Cmd, sizeof(Cmd), BusWidth, 0);
}

/*********************************************************************
*
*       _HW_Read
*
*  Function description
*    Transfers data from serial NOR flash to MCU.
*
*  Parameters
*    Unit           Index of the hardware layer (0-based).
*    Cmd            Code of the command to be sent.
*    pPara          [IN] Command parameters (address and dummy bytes). Can be NULL.
*    NumBytesPara   Total number of address and dummy bytes to be sent. Can be 0.
*    NumBytesAddr   Number of address bytes to be send. Can be 0.
*    pData          [OUT] Data read from the serial NOR flash device. Can be NULL.
*    NumBytesData   Number of bytes to read from the serial NOR flash device. Can be 0.
*    BusWidth       Number of data lines to be used for the data transfer.
*/
static void _HW_Read(U8 Unit, U8 Cmd, const U8 * pPara, unsigned NumBytesPara, unsigned NumBytesAddr, U8 * pData, unsigned NumBytesData, U16 BusWidth) {
  (void)_Read(Unit, &Cmd, sizeof(Cmd), pPara, NumBytesPara, NumBytesAddr, pData, NumBytesData, BusWidth, 0);
}

/*********************************************************************
*
*       _HW_Write
*
*  Function description
*    Transfers data from MCU to serial NOR flash.
*
*  Parameters
*    Unit           Index of the hardware layer (0-based).
*    Cmd            Code of the command to be sent.
*    pPara          [IN] Command parameters (address and dummy bytes). Can be NULL.
*    NumBytesPara   Total number of address and dummy bytes to be sent. Can be 0.
*    NumBytesAddr   Number of address bytes to be send. Can be 0.
*    pData          [IN] Data to be sent to the serial NOR flash device. Can be NULL.
*    NumBytesData   Number of bytes to be written the serial NOR flash device. Can be 0.
*    BusWidth       Number of data lines to be used for the data transfer.
*/
static void _HW_Write(U8 Unit, U8 Cmd, const U8 * pPara, unsigned NumBytesPara, unsigned NumBytesAddr, const U8 * pData, unsigned NumBytesData, U16 BusWidth) {
  (void)_Write(Unit, &Cmd, sizeof(Cmd), pPara, NumBytesPara, NumBytesAddr, pData, NumBytesData, BusWidth, 0);
}

/*********************************************************************
*
*       _HW_Poll
*
*  Function description
*    Checks periodically the value of a status flag.
*
*  Parameters
*    Unit           Index of the hardware layer (0-based).
*    Cmd            Code of the command to be sent.
*    BitPos         Position of the bit to be checked.
*    BitValue       Value of the bit to wait for.
*    Delay          Number of clock cycles to wait between two queries.
*    TimeOut_ms     Maximum number of milliseconds to wait for the bit to be set.
*    BusWidth       Number of data lines to be used for the data transfer.
*
*  Return value
*    > 0    Timeout occurred.
*    ==0    OK, bit set to specified value.
*    < 0    Feature not supported.
*/
static int _HW_Poll(U8 Unit, U8 Cmd, U8 BitPos, U8 BitValue, U32 Delay, U32 TimeOut_ms, U16 BusWidth) {
  int r;

#if FS_NOR_HW_USE_OS
  r = _Poll(Unit, &Cmd, sizeof(Cmd), NULL, 0, 0, BitPos, BitValue, Delay, TimeOut_ms, BusWidth, 0);
#else
  FS_USE_PARA(Unit);
  FS_USE_PARA(Cmd);
  FS_USE_PARA(BitPos);
  FS_USE_PARA(BitValue);
  FS_USE_PARA(Delay);
  FS_USE_PARA(TimeOut_ms);
  FS_USE_PARA(BusWidth);
  r = -1;                 // Set to indicate that the feature is not supported.
#endif
  return r;
}

